#!/bin/bash

# /bin/bash — точный путь к исполняемому файлу командной оболочки Bash, #! — символы шебанга (сочетание знаков Sharp # и Bang !), по которым ядро операционной системы 
# понимает, что файл является исполняемым скриптом

# Командная строка — отличный инструмент, но команды в неё приходится вводить каждый раз, когда в них возникает необходимость. Что если записать набор команд в файл и 
# просто вызывать этот файл для их выполнения? Собственно говоря, тот файл, о котором мы говорим, и называется сценарием командной строки.
# bash-скрипты — сценарии командной строки, написанные для оболочки bash. Сценарии командной строки — это наборы тех же самых команд, которые можно вводить с клавиатуры,
# собранные в файлы и объединённые некоей общей целью. При этом результаты работы команд могут представлять либо самостоятельную ценность, либо служить входными данными для других команд.
# Сценарии — это мощный способ автоматизации часто выполняемых действий.

echo 'working directory is:'
pwd
echo 'user is logged as:'
whoami

# pwd - print working directory (вывести рабочий каталог)
# whoami - вывести имя текущего пользователя, под которым вы сейчас авторизованы в системе.
