#!/usr/bin/bash

# Конструкция $((a+b)) в Bash используется для выполнения арифметических операций и получения их результата. Это называется
# арифметическим расширением (arithmetic expansion).
# "$(( ... ))" — это специальный синтаксис оболочки, который говорит системе: «внутри находятся числа и математические знаки, посчитай их».
# a и b — это имена переменных. Внутри двойных круглых скобок знак доллара $ перед именами переменных писать не обязательно (оболочка сама поймет
# , что это переменные). То есть $((a+b)) и $(($a+$b)) сработают одинаково.

# Важные особенности:
# Только целые числа: Базовый синтаксис Bash $((...)) поддерживает только целые числа (интегеры). Если попытаться сложить 5.5 + 2,
# возникнет ошибка. Для дробных чисел используют сторонние утилиты (например, bc).
# Любая математика: Внутри скобок можно использовать как плюс, так и: * (умножение), / (деление), - (вычитание), % (остаток от деления).

a=15
b=55
var1=$((a+b))
echo "$var1"
var2=$((var1+5)) # $((a+b)) и $(($a+$b)) работают одинаково
echo "$var2"
