#!/usr/bin/bash

# Пожалуй, нижеприведённые команды используются в bash-скриптах чаще всего. Они позволяют проверять различные условия, касающиеся
# файлов:
# -d file Проверяет, существует ли файл, и является ли он директорией.
# -e file Проверяет, существует ли файл.
# -f file Проверяет, существует ли файл, и является ли он файлом.
# -r file Проверяет, существует ли файл, и доступен ли он для чтения.
# -w file Проверяет, существует ли файл, и доступен ли он для записи.
# -x file Проверяет, существует ли файл, и является ли он исполняемым.
# -s file Проверяет, существует ли файл, и не является ли он пустым.
# file1 -nt file2 Проверяет, новее ли file1, чем file2.
# file1 -ot file2 Проверяет, старше ли file1, чем file2.
# -O file Проверяет, существует ли файл, и является ли его владельцем текущий пользователь.
# -G file Проверяет, существует ли файл, и соответствует ли его идентификатор группы идентификатору группы текущего пользователя.
# Эти команды, несложно запомнить. Их имена, являясь сокращениями от различных слов, указывающих на выполняемые ими проверки.

myFile=~/bashScripts/littleLessons/part1/6_checkingOfFiles.sh
if [ -f $myfile ]
then echo "myFile is exists and it's a file"
echo "It's not empty:"
cat $myFile
fi
