#!/usr/bin/bash

# Получение данных от пользователя (пользовательский ввод)
# Ключи и параметры командной строки — это отличный способ получить данные от того, кто пользуется скриптом, однако в некоторых случаях нужно больше интерактивности.
# Иногда сценарии нуждаются в данных, которые пользователь должен ввести во время выполнения программы. Именно для этой цели в оболочке bash имеется команда read.
# Эта команда позволяет принимать введённые данные либо со стандартного ввода (с клавиатуры), либо используя другие дескрипторы файлов. После получения данных, эта
# команда помещает их в переменную:
echo -n "Enter your name: " # по сценарию команда echo вызывается с ключом -n. Данный ключ необходим для того, чтобы после приглашения не было перевода строкм
read name
echo "Hello $name, welcome to my program!"

# read — это встроенная команда оболочки Bash, которая читает одну строку из стандартного ввода (stdin) или из файлового дескриптора и записывает её в одну или несколько переменных.

# Популярные флаги и опции команды read:
# -r — «сырой» режим (рекомендуется использовать почти всегда, т.к. реализует безопасное чтение). Отключает интерпретацию обратного слэша (\) как управляющего символа
# (например, \n не превратится в перенос строки).
# -p "текст" — выводит приглашение для ввода (prompt) прямо перед ожиданием ответа. При этом текст ОБЯЗАТЕЛЬНО следует за этим флагом, иначе будет ошибка
# -s — скрытый ввод (silent). Полезно при запросе паролей или конфиденциальных данных (символы на экране не отображаются).
# -t N — тайм-аут. Ожидает ввода пользователя ровно N секунд, после чего команда завершается с ошибкой.
# -n N — считывает не всю строку, а ровно N символов (и завершает работу без нажатия Enter).
# -a имя_массива — записывает считанные слова по отдельности в массив.
# -d разделитель — указывает кастомный символ окончания строки вместо стандартного перевода строки (\n).

read -p "Enter your name and surname: " first last # Несколько переменных в команде read
echo "Your data for $last, $first…"

# Если, вызвав read, не указывать переменную, данные, введённые пользователем, будут помещены в специальную переменную среды REPLY:
read -p "please enter amount of your projects for this year: "
echo "Hello, $REPLY? Not bad!"

echo "- - - - - - - -"
# Если скрипт должен продолжать выполнение независимо от того, введёт пользователь какие-то данные или нет, вызывая команду read можно воспользоваться ключом -t, который задаёт
# время ожидания ввода в секундах (Ограничение времени на ввод данных):
if read -t 5 -p "please enter how many salary do you need for 5 sec: " name
then
echo "What? $name, welcome to my office"
else # Если данные не будут введены в течение 5 секунд, скрипт выполнит ветвь условного оператора else
echo "Sorry, too slow! "
fi

echo "- - - - passwords' entering - - - -"
# Ввод паролей
# Иногда то, что вводит пользователь в ответ на вопрос скрипта, лучше на экране не показывать. Например, при запросе паролей. Ключ -s команды read предотвращает отображение
# на экране данных, вводимых с клавиатуры. На самом деле, данные выводятся, но команда read делает цвет текста таким же, как цвет фона.
read -p "please enter your password: " -s password
echo "" # пропуск строки
echo "ok, your pass is $password"

echo "- - - - reading from files - - - -"
# Команда read может, при каждом вызове, читать одну строку текста из файла. Когда в файле больше не останется непрочитанных строк, она просто остановится. Если нужно получить в скрипте всё
# содержимое файла, можно, с помощью конвейера (|), передать результаты вызова команды cat для файла, конструкции while, которая содержит команду read (конечно, использование команды cat
# выглядит примитивно, но цель — показать всё максимально просто, ориентируясь на новичков:
start=1
cat ../forTests.sh | while read line
do
echo "line number $start is: $line"
start=$(($start+1))
done
