#!/usr/bin/bash

# базовая структура цикла for:
# for var in list
# do
# команды
# done

# перебор простых значений
for var in 1 2 5
do
echo "$var"
done

echo "- - - - - - - -"

# перебор сложных значений
for var in "one" "the second" "I'll be back"
do
echo "The next phrase is: $var"
done

# кстати переменная var сохраняет значение при выходе из цикла:
echo "$var"
echo "- - - - - - - -"
# Инициализация цикла списком, полученным из результатов работы команды. Например, cat:
for var in $(cat ~/bashScripts/littleLessons/forTests.sh)
do
echo $var
done
# вышеприведенный подход, если ожидается построчная обработка данных, не сработает для файла более
# сложной структуры, в строках которого может содержаться по несколько слов, разделённых пробелами.
# Цикл будет обрабатывать отдельные слова, а не строки. Ниже решение данной проблемы.

# Разделители полей
# Причина вышеописанной особенности заключается в специальной переменной окружения, которая называется IFS
# (Internal Field Separator) и позволяет указывать разделители полей. По умолчанию оболочка bash считает
# разделителями полей следующие символы:
# - Пробел
# - Знак табуляции
# - Знак перевода строки
# Если bash встречает в данных любой из этих символов, он считает, что перед ним — следующее самостоятельное
# значение списка. Для того, чтобы решить проблему, можно временно изменить переменную среды IFS. Вот как это
# сделать в bash-скрипте, если исходить из предположения, что в качестве разделителя полей нужен только
# перевод строки:
# IFS=$'\n'
# После добавления этой команды в bash-скрипт, он будет работать как надо, игнорируя пробелы и знаки табуляции,
# считая разделителями полей лишь символы перевода строки.

# теперь уже можно дополнить предыдущий пример:
echo "- - - - - - - -"
# Инициализация цикла списком, полученным из результатов работы команды. Например, cat:
IFS=$'\n'
for var in $(cat ~/bashScripts/littleLessons/forTests.sh)
do
echo $var
done

# Разделителями могут быть и другие символы. Буквы и другие знаки препинания

echo "- - - - - - - -"
# Очень распространенный пример на обход файлов, содержащихся в директории
for item in ~/bashScripts/littleLessons/* # регулярка обязательна, иначе будет поиск только в директории
# к тому же здесь не нужно использовать ls, т. к. она видимо возвращает список строк
do
if [ -d $item ]
then
echo "$item is a directory"
elif [ -f $item ]
then echo "$item is a file"
fi
done

echo "- - - - - - - -"

# Циклы for в стиле C
# В bash-скриптах можно использовать циклы for, описание которых выглядит очень похожим на циклы в стиле C, правда,
# без некоторых отличий тут не обошлось. Схема цикла при подобном подходе выглядит так:
# for (( начальное значение переменной ; условие окончания цикла; изменение переменной ))
# for (( a = 1; a < 10; a++ ))

for (( i=1; i <= 5; i++ ))
do
echo "number is $i"
done
