#!/usr/bin/bash

# Чтение параметров командной строки
# Оболочка bash назначает специальным переменным, называемым позиционными параметрами, введённые при вызове скрипта параметры командной строки:
# $0 — имя скрипта.
# $1 — первый параметр.
# $2 — второй параметр — и т. д., вплоть до переменной $9, в которую попадает девятый параметр.
# Если скрипту надо больше девяти параметров, при обращении к ним номер в имени переменной надо заключать в фигурные скобки: ${15}

echo "$0"
echo $(($1+$2))

# Параметры командной строки не обязательно должны быть числами. Сценариям можно передавать и строки
echo "Hello $3! How do you do?"

# если параметр содержит пробелы, а нам надо обрабатывать его как самостоятельный фрагмент данных, то нужно использовать кавычки
echo "$4"

# Проверка параметров
# Если скрипт вызван без параметров, но для нормальной работы кода предполагается их наличие, то возникнет ошибка. Поэтому рекомендуется
# всегда проверять наличие параметров, переданных сценарию при вызове. Например, это можно организовать с помощью рассмотренного в теме сравнения
# строк флага -n (проверка того, что длина строки больше 0):
if [[ -n $5 ]]
then echo "$5"
else echo "the parameter isn't valid"
fi

# Подсчёт параметров
# В скрипте можно подсчитать количество переданных ему параметров с помощью специальной переменной $#. Именно она содержит количество параметров,
# переданных сценарию при вызове.
echo "there were $# parameters passed"

# Эта переменная в виде {!#} даёт возможность получения последнего из переданных скрипту параметров, не требующий знания их количества:
echo "the last parameter is ${!#}"

# Захват всех параметров командной строки
# В некоторых случаях нужно захватить все параметры, переданные скрипту. Для этого можно воспользоваться переменными $* и $@. Обе они содержат
# все параметры командной строки, что делает возможным доступ к тому, что передано сценарию, без использования позиционных параметров.
# В переменной $@ параметры разбиты на отдельные «слова» (как бы массив из значений). Эти параметры можно перебирать в циклах.
# Переменная $* содержит все параметры, введённые в командной строке, в виде единого «слова».
# Переменная $* содержит все переданные скрипту параметры как единый фрагмент данных, в то время как в переменной $@ они представлены
# самостоятельными значениями:
count=1
for param in "$*"
do
echo "\$* Parameter #$count = $param"
count=$(( $count + 1 ))
done
count=1
for param in "$@"
do
echo "\$@ Parameter #$count = $param"
count=$(( $count + 1 ))
done
# вот вывод:
# $* Parameter #1 = 5 15 Haidaric I'm the father
# $@ Parameter #1 = 5
# $@ Parameter #2 = 15
# $@ Parameter #3 = Haidaric
# $@ Parameter #4 = I'm the father

# Команда shift
# Использовать команду shift в bash-скриптах следует с осторожностью, т. к., в прямом смысле слова, сдвигает значения позиционных параметров.
# Когда вы используете эту команду, она, по умолчанию, сдвигает значения позиционных параметров влево. Например, значение переменной $3
# становится значением переменной $2, значение $2 переходит в $1, а то, что было до этого в $1, теряется. Обратите внимание на то, что при этом
# значение переменной $0, содержащей имя скрипта, не меняется
# Используя команду shift, помните о том, что при каждом её вызове значение переменной $1 безвозвратно теряется:
shift
echo $1
echo $2
echo $3 # параметр $4 действительно стал $3
