#!/usr/bin/bash

# Конструкция case в Bash — это аналог оператора switch из других языков программирования. Она используется, когда нужно сравнить одну
# переменную с множеством разных значений (шаблонов) и выполнить соответствующий код. Эта конструкция гораздо удобнее и читаемее, чем
# длинные цепочки if-elif-else, когда проверяется одно и то же значение.

# Базовый синтаксис
# case "переменная" in
#    шаблон_1)
#        # Код, если переменная совпала с шаблоном_1
#        ;;
#    шаблон_2)
#        # Код, если переменная совпала с шаблоном_2
#        ;;
#    *)
#        # Код по умолчанию (если ни один шаблон не подошел)
#        ;;
# esac

case "aa" in
  "aa")
    echo "aa is here"
    ;;
  "-aba")
    echo "it's impossible"
    ;;
  *)
    echo "it's unexpected"
    ;;
esac

echo "finish"

# in terminal I'll see:
# aa is here
# finish
