#!/usr/bin/bash

# Ключи командной строки обычно выглядят как буквы, перед которыми ставится тире. Они служат для управления сценариями

# Пример обработки ключей в скрипте
while [ -n "$1" ] # цикл работает до тех пор, пока переменная $1 (первый аргумент) не станет пустой (флаг -n проверяет, что строка имеет ненулевую длину)
do
case "$1" in
  -a) echo "Found the -a option" ;;
  -b) echo "Found the -b option" ;;
  -c) echo "Found the -c option" ;;
  *) echo "$1 is not an option" ;;
esac
shift	# команда, которая «сдвигает» все аргументы влево: то, что было в $2, попадает в $1, $3 становится $2 и т.д. Первый старый аргумент при этом удаляется.
	# И если изначально было передано 3 аргумента, то все равно можно будет сослаться на $4, который будет пустым, и за несколько циклов станет $1,
	# В этот момент цикл прервется
done

# Вот что будет в терминале:
# Passed: $ ./12_CLI_keys.sh -a -s -c
# Got:
# Found the -a option
# -s is not an option
# Found the -c option

# Как различать ключи и параметры
# Часто при написании bash-скриптов возникает ситуация, когда надо использовать и параметры командной строки, и ключи. Стандартный способ это сделать
# заключается в применении специальной последовательности символов, которая сообщает скрипту о том, когда заканчиваются ключи и начинаются обычные параметры.
# Эта последовательность — двойное тире (--). Оболочка использует её для указания позиции, на которой заканчивается список ключей.
# Пример на обработку ключей и параметров командной строки:
echo $@
while [ -n "$1" ]
do
  case "$1" in
    -a) echo "Found the -a option" ;;
    -k) echo "Found the -b option";;
    --) shift
     break ;; # Этот сценарий использует команду break для прерывания цикла while при обнаружении в строке двойного тире
    *) echo "$1 is not an option";;
  esac
  shift
done
echo $@
count=1
for param in $@
do
  echo "Parameter #$count: $param"
  count=$(( $count + 1 ))
done
# Вот что будет в терминале:
# Passed: $ ./12_CLI_keys.sh -a -s -c -- 5 15 25
# Got:
# -a -s -c -- 5 15 25
# Found the -a option
# -s is not an option
# -c is not an option
# 5 15 25
# Parameter #1: 5
# Parameter #2: 15
# Parameter #3: 25
# Как видно, когда скрипт, разбирая переданные ему данные, находит двойное тире, он завершает обработку ключей и считает всё, что ещё не обработано, параметрами.

# Обработка ключей со значениями
# Бывают ситуации, когда обычных ключей недостаточно, а значит, уже нужно использовать ключи с параметрами
# Например, вызов сценария в котором используется подобная возможность, выглядит так:
# ./myscript -a -b test2 -c
# Скрипт должен уметь определять, когда вместе с ключами командной строки используются дополнительные параметры:
while [ -n "$1" ]
do
  case "$1" in
    -a) echo "Found the -a option";;
    -b) param="$2" # Т.к. обрабатываемый ключ находится в переменной $1, соответствующий ему параметр будет находиться в $2
      echo "Found the -b option, with parameter value $param"
      shift ;; # тут понадобится ещё одна команда shift для того, чтобы следующий ключ попал в $1
    -c) echo "Found the -c option";;
    --) shift
     break ;;
    *) echo "$1 is not an option";;
  esac
 shift
done
count=1
for param in "$@"
do
  echo "Parameter #$count: $param"
  count=$(( $count + 1 ))
done
# Вот что будет в терминале:
# Passed: $ ./12_CLI_keys_part2.sh -k -b 15 -c -- 25 25
# Got:
# -k is not an option
# Found the -b option, with parameter value 15
# Found the -c option
# Parameter #1: 25
# Parameter #2: 25

# Использование стандартных ключей
# При написании bash-скриптов вы можете выбирать любые буквы для ключей командной строки и произвольно задавать реакцию скрипта на эти ключи. Однако, в мире Linux
# значения некоторых ключей стали чем-то вроде стандарта, которого полезно придерживаться. Вот список этих ключей:
# -a Вывести все объекты.
# -c Произвести подсчёт.
# -d Указать директорию.
# -e Развернуть объект.
# -f Указать файл, из которого нужно прочитать данные.
# -h Вывести справку по команде.
# -i Игнорировать регистр символов.
# -l Выполнить полноформатный вывод данных.
# -n Использовать неинтерактивный (пакетный) режим.
# -o Позволяет указать файл, в который нужно перенаправить вывод.
# -q Выполнить скрипт в quiet-режиме.
# -r Обрабатывать папки и файлы рекурсивно.
# -s Выполнить скрипт в silent-режиме.
# -v Выполнить многословный вывод.
# -x Исключить объект.
# -y Ответить «yes» на все вопросы.
# Если вы работаете в Linux, вам, скорее всего, знакомы многие из этих ключей. Использовав их в общепринятом значении в своих скриптах, вы поможете пользователям
# взаимодействовать с ними, не беспокоясь о чтении документации.
