#!/usr/bin/bash

# Дескриптор файла (File Descriptor, FD) в Linux — это целое неотрицательное число, которое операционная система использует для представления открытого файла, сокета,
# канала связи или другого объекта ввода/вывода. Он служит уникальным идентификатором, через который процесс взаимодействует с этим ресурсом: читает, записывает данные
# или управляет им.

# Стандартные дескрипторы файлов
# Всё в Linux — это файлы, в том числе — ввод и вывод. Операционная система идентифицирует файлы с использованием дескрипторов. Каждому процессу позволено иметь до
# девяти открытых дескрипторов файлов. Оболочка bash резервирует первые три дескриптора с идентификаторами 0, 1 и 2. Вот что они означают:
# 0, STDIN — стандартный поток ввода.
# 1, STDOUT — стандартный поток вывода.
# 2, STDERR — стандартный поток ошибок.
# Эти три специальных дескриптора обрабатывают ввод и вывод данных в сценарии. Вам нужно как следует разобраться в стандартных потоках. Их можно сравнить с фундаментом, на
# котором строится взаимодействие скриптов с внешним миром. Рассмотрим подробности о них.

# 	STDIN
# STDIN — это стандартный поток ввода оболочки. Для терминала стандартный ввод — это клавиатура. Когда в сценариях используют символ перенаправления ввода — "<", Linux заменяет
# дескриптор файла стандартного ввода на тот, который указан в команде. Система читает файл и обрабатывает данные так, будто они введены с клавиатуры.
# Многие команды bash принимают ввод из STDIN, если в командной строке не указан файл, из которого надо брать данные. Например, это справедливо для команды cat.
# Когда вы вводите команду cat в командной строке, не задавая параметров, она принимает ввод из STDIN. После того, как вы вводите очередную строку, cat просто выводит её на
# экран.

echo "- - - - перенаправление ввода из файла - - - -"
count=1
while read row
do
echo "row number $count is $row"
count=$(($count+1))
done < output.txt # myself

# 	STDOUT
# STDOUT — стандартный поток вывода оболочки. По умолчанию это — экран. Большинство bash-команд выводят данные в STDOUT, что приводит к их появлению в консоли. Данные можно
# перенаправить в файл, присоединяя их к его содержимому, для этого служит команда ">>".
# Итак, у нас есть некий файл с данными, к которому мы можем добавить другие данные с помощью этой команды:
echo "- - - - перенаправление вывода в файл - - - -"
pwd >> output.txt # То, что выведет pwd, будет добавлено к файлу myfile, при этом уже имеющиеся в нём данные никуда не денутся.

# если попытаться выполнить что-то вроде показанного ниже, обратившись к несуществующему файлу xfile, задумывая всё это для того, чтобы в файл myfile попало сообщение об
# ошибке:
ls –l xfile > myfile # После выполнения этой команды мы увидим сообщения об ошибках на экране.
# При попытке обращения к несуществующему файлу генерируется ошибка, но оболочка не перенаправила сообщения об ошибках в файл, выведя их на экран. Но мы-то хотели, чтобы
# сообщения об ошибках попали в файл. Что делать? Ответ прост — воспользоваться третьим стандартным дескриптором.

# 	STDERR
# STDERR представляет собой стандартный поток ошибок оболочки. По умолчанию этот дескриптор указывает на то же самое, на что указывает STDOUT, именно поэтому при
# возникновении ошибки мы видим сообщение на экране.
# Итак, предположим, что надо перенаправить сообщения об ошибках, скажем, в лог-файл, или куда-нибудь ещё, вместо того, чтобы выводить их на экран.
echo "- - - - перенаправление потока ошибок в файл - - - -"
# Как вы уже знаете, дескриптор файла STDERR — 2. Мы можем перенаправить ошибки, разместив этот дескриптор перед командой перенаправления:
ls -l xfile 2>myfile
cat ./myfile

echo "- - - - перенаправление потоков вывода и ошибок в файлы - - - -"
# При написании сценариев командной строки может возникнуть ситуация, когда нужно организовать и перенаправление сообщений об ошибках, и перенаправление стандартного
# вывода. Для того, чтобы этого добиться, нужно использовать команды перенаправления для соответствующих дескрипторов с указанием файлов, куда должны попадать ошибки и
# стандартный вывод:
ls –l myfile xfile anotherfile 2> errorcontent 1> correctcontent # "1>" "2>", Оболочка перенаправит то, что команда ls обычно отправляет в STDOUT, в файл correctcontent
# благодаря конструкции 1>. Сообщения об ошибках, которые попали бы в STDERR, оказываются в файле errorcontent из-за команды перенаправления 2>.

# Если надо, и STDERR, и STDOUT можно перенаправить в один и тот же файл, воспользовавшись командой "&>":
ls –l myfile xfile anotherfile &> content

# Перенаправление вывода в скриптах. Существует два метода перенаправления вывода в сценариях командной строки:
# - Временное перенаправление, или перенаправление вывода одной строки.
# - Постоянное перенаправление, или перенаправление всего вывода в скрипте либо в какой-то его части.

# 	Временное перенаправление вывода
# В скрипте можно перенаправить вывод отдельной строки в STDERR. Для того, чтобы это сделать, достаточно использовать команду перенаправления, указав дескриптор STDERR,
# при этом перед номером дескриптора надо поставить символ амперсанда (&):
echo "This is an error" >&2 # >&2 — конструкция перенаправления в Bash: говорит оболочке «направь вывод этой команды в дескриптор 2, т.е. в поток стандартных ошибок»
# ">&2" (то же, что и 1>&2) 
./myscript 2> myfile # другой пример

# 	Постоянное перенаправление вывода
# Если в скрипте нужно перенаправлять много выводимых на экран данных, добавлять соответствующую команду к каждому вызову echo неудобно. Вместо этого можно задать
# перенаправление вывода в определённый дескриптор на время выполнения скрипта, воспользовавшись командой "exec":
exec 1>outfile
echo "This is a test of redirecting all output"
echo "from a shell script to another file."
echo "without having to redirect every line"

# Если просмотреть файл, указанный в команде перенаправления вывода, окажется, что всё, что выводилось командами echo, попало в этот файл. Команду exec можно использовать не
# только в начале скрипта, но и в других местах:
exec 2>myerror
echo "This is the start of the script"
echo "now redirecting all output to another location"
exec 1>myfile
echo "This should go to the myfile file"
echo "and this should go to the myerror file" >&2
# Сначала команда exec задаёт перенаправление вывода из STDERR в файл myerror. Затем вывод нескольких команд echo отправляется в STDOUT и выводится на экран. После этого
# команда exec задаёт отправку того, что попадает в STDOUT, в файл myfile, и, наконец, мы пользуемся командой перенаправления в STDERR в команде echo, что приводит к
# записи соответствующей строки в файл myerror.

# Перенаправление ввода в скриптах
# Для перенаправления ввода можно воспользоваться той же методикой, которую мы применяли для перенаправления вывода. Например, команда exec позволяет сделать источником
# данных для STDIN какой-нибудь файл:
exec 0< myfile # Эта команда указывает оболочке на то, что источником вводимых данных должен стать файл myfile, а не обычный STDIN

# 	Создание собственного перенаправления вывода
# Перенаправляя ввод и вывод в сценариях, вы не ограничены тремя стандартными дескрипторами файлов. Как уже говорилось, можно иметь до девяти открытых дескрипторов.
# Остальные шесть, с номерами от 3 до 8, можно использовать для перенаправления ввода или вывода. Любой из них можно назначить файлу и использовать в коде скрипта.
