#!/usr/bin/bash

# Я понял, что знак $ это как указатели в golang для ссылки на переменные
# Существуют два типа переменных, которые можно использовать в bash-скриптах: 1) Переменные среды, 2) Пользовательские переменные
# $HOME — встроенная переменная окружения в Unix-подобных системах (Linux, macOS), которая содержит абсолютный путь к домашнему каталогу текущего пользователя

echo "$HOME" # environment variable

# экранирование \
echo "I need \$15"

name="Adam" # user-defined variable, обязательно без пробелов
value=2
echo "$name have $value buildings"

# Command substitution (подстановка команд)
# Подстановка команд - возможность извлекать информацию из вывода команд и назначать её переменным, что позволяет использовать эту информацию где
# угодно в файле сценария. Сделать это можно двумя способами:
# - С помощью значка обратного апострофа «`»;
# - С помощью конструкции $().

#тогда:
pwd
myDir=`pwd` # как сырая строка в python
echo "$myDir"
echo "$(pwd)"
